class ExpenditureCost < ApplicationRecord
  # ------------------------------------------------------------------------------------------------------------------
  # enum設定
  enum category: { 
    食費: 0, 日用品費: 1, 光熱費: 2, 通信費: 3, 住居費: 4, 衣服費: 5,
    交際費: 6, 医療費: 7, 娯楽費: 8, 美容費: 9, 経費: 10, 教育費: 11,
    欲しかったもの: 12, その他: 13
  }
  # ------------------------------------------------------------------------------------------------------------------
  # アソシエーション
  belongs_to :member
  # ------------------------------------------------------------------------------------------------------------------
  # バリデーション
  validates :expenses_name, presence: true
  validates :price, numericality: { greater_than: 0, less_than_or_equal_to: 1_000_000_000_000 } # numericality: { greater_than: 0 }: マイナス金額や０円のデータの保存を防ぐ
  validates :date, presence: true
  # ------------------------------------------------------------------------------------------------------------------
end